{"legislative_id": 58790, "legislative_title": "Georgia Lottery for Assistance of Homeless Military Veterans Act; enact", "document_text": "LC 41 2634 House Bill 5 By: Representatives Scott of the 76th, Cannon of the 58th, Mitchell of the 88th, Jackson of the th, and Burnough of the 77th A BILL TO BE ENTITLED AN ACT To amend Chapter 27 of Title 50 of the Official Code of Georgia Annotated, relating to lottery for education, so as to provide that the Georgia Lottery Corporation shall offer one or more games to benefit homeless military veterans; to provide a short title; to provide for definitions; to provide for the deposit of proceeds into the general fund; to provide for a special account to be appropriated for veterans' programs; to provide for purposes for which appropriations shall be made; to provide for lapsing of funds; to provide for related matters; to provide a conditional effective date and automatic repeal; to repeal conflicting laws; and for other purposes. BE IT ENACTED BY THE GENERAL ASSEMBLY OF GEORGIA: SECTION 1. Chapter 27 of Title 50 of the Official Code of Georgia Annotated, relating to lottery for education, is amended by adding a new article to read as follows: H. B. 5 - 1 -  LC 41 2634 \"ARTICLE 4 -27-120. This article shall be known and may be cited as the 'Georgia Lottery for Assistance of Homeless Military Veterans Act.' -27-121. (a) As used in this Code section, the term: (1) 'Account' means the lottery for assistance of homeless military veterans account. (2) 'Veteran' means an individual who served on active duty in the armed forces of the United States or a state's National Guard and was honorably discharged from such service. (b) The corporation shall offer one or more lottery games for the benefit of Georgia homeless military veterans. The lottery game or games shall commence on January 1, 2024, or as soon thereafter as is reasonably practical. The operation of the lottery game or games shall be governed by Article 1 of this chapter. If any provision of this article is inconsistent with any other provision of this chapter, then this article shall govern. -27-122. On or before the fifteenth day of each quarter, the corporation shall transfer to the general fund of the state treasury, for credit to the account for the preceding quarter, the amount of all net proceeds during the preceding quarter from the lottery game or games for the benefit of Georgia veterans. Net proceeds shall be deposited in such account and separately overseen by the state treasurer by establishing and maintaining such account within the state treasury. H. B. 5 - 2 -  -27-123. LC 41 2634 Upon their deposit into the state treasury, any moneys representing a deposit of net proceeds shall then become the unencumbered property of the State of Georgia, and the corporation shall have no power to agree or undertake otherwise. Such moneys shall be invested by the state treasurer in accordance with state investment practices. All earnings attributable to such investments shall likewise be the unencumbered property of the state and shall accrue to the credit of the account. -27-124. (a) In the budget report to the General Assembly, as a separate budget category entitled 'lottery for assistance of homeless military veterans proceeds,' the Governor shall estimate the amount of net proceeds and treasury earnings thereon to be credited to the account during the fiscal year and the amount of unappropriated surplus estimated to be accrued in the account at the beginning of the fiscal year. The sum of estimated net proceeds, treasury earnings thereon, and unappropriated surplus shall be designated 'lottery for assistance of homeless military veterans proceeds.' (b) In the budget report, the Governor shall further make specific recommendations as to the programs and purposes for which appropriations should be made fromthe account. The General Assembly shall appropriate from such account by specific reference to it, or by reference to 'lottery for assistance of homeless military veterans proceeds.' All appropriations of lottery for assistance of homeless military veterans proceeds to any particular budget unit shall be made together in a separate part entitled, identified, administered, and accounted for separately as a distinct budget unit for lottery for assistance of homeless military veterans proceeds. Such appropriations shall otherwise be made in the manner required by law for appropriations. Such appropriations shall be made for eliminating homelessness, preventing near-term homelessness, and providing safe and secure living conditions for homeless military veterans. H. B. 5 - 3 -  -27-125. LC 41 2634 Appropriations for homeless military veterans' programs from the account not committed during the fiscal year shall lapse to the general fund and shall be credited to the account. -27-126. Except as provided by this article, appropriations from the account shall be subject to Part 1 of Article 4 of Chapter 12 of Title 45, the 'Budget Act.'\" SECTION 2. This Act shall become effective on January 1, 2023, only if an amendment to the Constitution of Georgia is ratified at the time of the general election held in 2022 authorizing the expenditure of lottery funds for the benefit of veterans' programs. Otherwise, this Act shall stand automatically repealed on December 31, 2022. SECTION 3. All laws and parts of laws in conflict with this Act are repealed. H. B. 5 - 4 -"}