{"legislative_id": 58791, "legislative_title": "Income tax; investors in women owned businesses; provide tax credit", "document_text": "LC 44 1545 House Bill 6 By: Representatives Scott of the 76th, Kendrick of the 93rd, Bazemore of the 63rd, Schofield of the 60th, Thomas of the 39th, and others A BILL TO BE ENTITLED AN ACT To amend Chapter 7 of Title 48 of the Official Code of Georgia Annotated, relating to income taxes, so as to provide for an income tax credit for investors in women owned businesses; to provide for definitions; to provide for registration with the commissioner of revenue; to provide for conditions and limitations; to provide for recapture; to provide for rules and regulations; to provide for related matters; to repeal conflicting laws; and for other purposes. BE IT ENACTED BY THE GENERAL ASSEMBLY OF GEORGIA: SECTION 1. Chapter 7 of Title 48 of the Official Code of Georgia Annotated, relating to income taxes, is amended by adding a new Code section to read as follows: \"48-7-40.37. (a) As used in this Code section, the term: (1) 'Allowable credit' means the credit as it may be reduced pursuant to paragraph (3) of subsection (h) of this Code section. (2) 'Headquarters' means the principal administrative office of a business located in this state which conducts significant operations of such business. H. B. 6 - 1 -  LC 44 1545 (3) 'Pass-through entity' means a partnership, an S-corporation, or a limited liability company taxed as a partnership. (4) 'Qualified business' means a registered business that: (A) Is either a corporation, limited liability company, or general or limited partnership located in this state; (B) Was organized no more than five years before the qualified investment was made; (C) Had its headquarters located in this state at the time the investment was made and has maintained such headquarters for the entire time the qualified business benefited from the tax credit provided for in this Code section; (D) Employs 20 or fewer people in this state at the time it is registered as a qualified business; (E) Has had in any complete fiscal year before registration gross annual revenue of $500,000.00 or less on a consolidated basis, as determined in accordance with the Internal Revenue Code; (F) Has not obtained during its existence more than $1 million in aggregate gross cash proceeds from the issuance of its equity or debt investments, not including commercial loans from chartered banking or savings and loan institutions; (G) Has not utilized the tax credit described in Code Section 48-7-40.26; (H) Isprimarilyengagedinmanufacturing, processing, onlineanddigitalwarehousing, logistics, onlineanddigitalwholesaling, softwaredevelopment, informationtechnology services, research and development, or a business providing services other than those described in subparagraph (I) of this paragraph; (I) Is owned and controlled by one or more women; and (J) Does not engage substantially in: (i) Real estate; (ii) Gambling; (iii) Natural resource extraction; H. B. 6 - 2 -  LC 44 1545 (iv) Financial, brokerage, or investment activities or insurance; or (v) Amusement, recreation, or athletic or fitness activity for which an admission or membership is charged. A business shall be substantially engaged in one of the activities listed in this paragraph if its gross revenue from such activity exceeds 25 percent of its gross revenues in any fiscal year or it is established pursuant to its articles of incorporation, articles of organization, operatingagreement, orsimilarorganizationaldocumentstoengageinsuch activity as one of its primary purposes. (5) 'Qualified investment' means an investment by a qualified investor of cash in a qualified business for common or preferred stock or an equity interest or purchase for cash of qualified subordinated debt in a qualified business; provided, however, that funds constituting a qualified investment cannot have been raised or be raised as a result of other tax incentive programs. Furthermore, no investment of common or preferred stock or an equity interest or purchase for cash of qualified subordinated debt shall qualify as a qualified investment if a broker fee or commission or a similar remuneration is paid or given directly or indirectly for soliciting such investment or purchase. (6) 'Qualified investor' means an accredited investor as that term is defined by the United States Securities and Exchange Commission who is: (A) An individual person who is a resident of this state or a nonresident who is obligated to pay taxes imposed by this chapter; or (B) A pass-through entity which is formed for investment purposes, has no business operations, has committed capital under management of equal to or less than $5 million, and is not capitalized with funds raised or pooled through private placement memoranda directed to institutional investors. A venture capital fund or commodity fund with institutional investors or a hedge fund shall not qualify as a qualified investor. (7) 'Qualified subordinated debt' means indebtedness that is not secured, that may or may not be convertible into common or preferred stock or other equity interest, and that is H. B. 6 - 3 -  LC 44 1545 subordinated in payment to all other indebtedness of the qualified business issued or to be issued for money borrowed and no part of which has a maturity date less than five years after the date such indebtedness was purchased. (8) 'Registered' or 'registration' means that a business has been certified by the commissioner as a qualified business at the time of application to the commissioner. (b) A qualified business shall register with the commissioner for purposes of this Code section. Approval of such registration shall constitute certification by the commissioner for 12 months after being issued. A business shall be permitted to renew its registration with the commissioner so long as, at the time of renewal, the business remains a qualified business. (c) Any individual person making a qualified investment directly in a qualified business in a particular calendar year shall be allowed a tax credit of 25 percent of the amount invested against the tax imposed by this chapter commencing on January 1 of the second year following the year in which the qualified investment was made as provided in this Code section, 15 percent of the amount invested against the tax imposed by this chapter commencing on January 1 of the third year following the year in which the qualified investment was made as provided in this Code section, and 10 percent of the amount invested against the tax imposed by this chapter commencing on January 1 of the fourth year following the year in which the qualified investment was made as provided in this Code section. (d) Any pass-through entity making a qualified investment directly in a qualified business in a particular calendar year shall be allowed a tax credit of 25 percent of the amount invested against the tax imposed by this chapter commencing on January 1 of the second year following the year in which the qualified investment was made as provided in this Code section, 15 percent of the amount invested against the tax imposed by this chapter commencing on January 1 of the third year following the year in which the qualified investment was made as provided in this Code section, and 10 percent of the amount H. B. 6 - 4 -  LC 44 1545 invested against the tax imposed by this chapter commencing on January 1 of the fourth year following the year in which the qualified investment was made as provided in this Code section. Each individual who is a shareholder, partner, or member of an entity shall be allocated the credit allowed the pass-through entity in an amount determined in the same manner as the proportionate shares of income or loss of such pass-through entity would be determined. If an individual's share of the pass-through entity's credit is limited due to the maximum allowable credit under this Code section for a taxable year, the pass-through entity and its owners may not reallocate the unused credit among the other owners. (e) Tax credits claimed pursuant to this Code section shall be subject to the following conditions and limitations: (1) The qualified investor shall not be eligible for the credit for the taxable year in which the qualified investment is made but shall be eligible for the credit for the second taxable year beginning after the qualified investment is made as provided in subsection (c) or (d) of this Code section; (2) The aggregate amount of credit allowed an individual for one or more qualified investments in a single taxable year under this Code section, whether made directly or by a pass-through entity and allocated to such individual, shall not exceed $100,000.00; (3) In no event shall the amount of the tax credit allowed an individual under this Code section for a taxable year exceed such individual's Georgia net income tax liability. Any unused credit amount shall be allowed to be carried forward for five years from the close of the taxable year in which the qualified investment was made. No such credit shall be allowed against prior years' tax liability; (4) The qualified investor's basis in the common or preferred stock, equity interest, or subordinated debt acquired as a result of the qualified investment shall be reduced for purposes of this chapter by the amount of the allowable credit; and H. B. 6 - 5 -  LC 44 1545 (5) The credit shall not be transferrable by the qualified investor except to the heirs and legatees of the qualified investor upon his or her death and to his or her spouse or incident to divorce. (f) The registration of a business as a qualified business shall be subject to the following conditions and limitations: (1) If the commissioner finds that any of the information contained in an application of a business for registration under this Code section is false, the commissioner shall revoke the registration of such business. The commissioner shall not revoke the registration of a business solely because it ceases business operations for an indefinite period of time, so long as the business renews its registration; (2) A registration as a qualified business may not be sold or otherwise transferred, except that, if a qualified business enters into a merger, conversion, consolidation, or other similar transaction with another business and the surviving company would otherwise meet the criteria for being a qualified business, the surviving company retains the registration for the 12 month registration period without further application to the commissioner. In such a case, the qualified business must provide the commissioner with written notice of the merger, conversion, consolidation, or similar transaction and such other information as required by the commissioner; and (3) The commissioner shall report to the House Committee on Ways and Means and the Senate Finance Committee each year all of the businesses that have registered with the commissioner as a qualified business. The report shall include the name and address of each business, the location of its headquarters, a description of the types of business in which it engages, the number of jobs created by the business during the period covered by the report, and the average wages paid by these jobs. (g) Any credit claimed under this Code section shall be recaptured in the following situations and shall be subject to the following conditions and limitations: H. B. 6 - 6 -  LC 44 1545 (1) If within two years after the qualified investment was made, the qualified investor transfers any of the securities or qualified subordinated debt received in the qualified investment to another person or entity, other than a transfer resulting from one of the following: (A) The death of the investor; (B) A transfer to the spouse of the investor or incident to divorce; or (C) A merger, conversion, consolidation, sale of the qualified business's assets, or similar transaction requiring approval by the owners of the qualified business under applicable law, to the extent the investor does not receive cash or tangible property in such merger, conversion, consolidation, sale, or other similar transaction; (2) Except as provided in paragraph (1) of this subsection, if within five years after the qualified investment was made, the qualified business makes a redemption with respect to the securities received or pays any principal of the qualified subordinated debt; (3) If within two years after the qualified investment was made, the investor participates in the operation of the qualified business. For the purposes of this paragraph, a qualified investor participates in the operation of a qualified business if the qualified investor, or the qualified investor's spouse, parent, sibling, or child, or a business controlled by any of these individuals, provides services of any nature to the qualified business for compensation, whether as an employee, a contractor, or otherwise; provided, however, that a person who provides uncompensated professional advice to a qualified business, whether as an officer, a member of the board of directors or managers, or otherwise, or participates in a stock or membership option or stock or membership plan, or both, shall be eligible for the credit; (4) The amount of the credit recaptured shall apply only to the qualified investment in the particular qualified business in which the investment was made; H. B. 6 - 7 -  LC 44 1545 (5) The amount of the recaptured tax credit determined under this subsection shall be added to the qualified investor's income tax liability for the taxable year in which the recapture occurs under this subsection; and (6) In the event the credit is recaptured because the qualified business ceases business operations, dissolves, or liquidates, the qualified investor may claim either the credit authorized under this Code section or any capital loss the qualified investor otherwise would be able to claim regarding that qualified business, but shall not be authorized to claim and be allowed both. (h)(1) A qualified investor seeking to claim a tax credit provided for under this Code section shall submit an application to the commissioner for tentative approval of such tax credit between September 1 and October 31 of the year for which the tax credit is claimed or allowed. The commissioner shall promulgate the rules and forms on which the application is to be submitted. Amounts specified on such application shall not be changed by the qualified investor after the application is approved by the commissioner. The commissioner shall review such application and shall tentatively approve such application upon determining that it meets the requirements of this Code section. (2) The commissioner shall provide tentative approval of the applications by the date provided in paragraph (3) of this subsection, provided that the total aggregate amount of all tax credits allowed to investors or pass-through entities for investments made in a calendar year and claimed and allowed in the following taxable year shall not exceed $5 million in such year. (3) The commissioner shall notify each qualified investor of the tax credits tentatively approved and allocated to such qualified investor by December 31 of the year in which the application was submitted. In the event that the credit amounts on the tax credit applications filed with the commissioner exceed the maximum aggregate limit of tax credits under this subsection, then the tax credits shall be allocated among the qualified investors who filed a timely application on a pro rata basis based upon the amounts H. B. 6 - 8 -  LC 44 1545 otherwise allowed by this Code section. Once the tax credit application has been approved and the amount approved has been communicated to the applicant, the qualified investor may then apply the amount of the approved tax credit to its tax liability for the tax year for which the approved application applies. (i) The commissioner shall promulgate any rules and regulations necessary to implement and administer this Code section.\" SECTION 2. All laws and parts of laws in conflict with this Act are repealed. H. B. 6 - 9 -"}