{"legislative_id": 58787, "legislative_title": "Georgia Constitutional Carry Act of 2021; enact", "document_text": "LC 28 9877 House Bill 2 By: Representatives Dunahoo of the 30th, Tarvin of the 2nd, Barr of the 103rd, Cantrell of the nd, Clark of the 147th, and others A BILL TO BE ENTITLED AN ACT To amend Article 1 of Chapter 3 of Title 12 of the Official Code of Georgia Annotated, relating to general provisions regarding parks, historic areas, memorials, and recreation, so as to revise provisions of law regarding the use or possession of any handgun in a park, historic site, or recreational area; to amend Part 3 of Article 4 of Chapter 11 of Title 16 of the Official Code of Georgia Annotated, relating to carrying and possession of firearms, so as to provide a definition; to revise provisions of law regarding the carrying of firearms; to amend Part 2 of Article 4 of Chapter 12 of Title 16 of the Official Code of Georgia Annotated, relating to transportation passenger safety, so as to revise provisions of law regarding the carrying of firearms; to amend Title 27 of the Official Code of Georgia Annotated, relating to game and fish, so as to revise certain laws regarding the carrying of firearms; to amend Part 2 of Article 10 of Chapter 6 of Title 40 of the Official Code of Georgia Annotated, relating to parking for persons with disabilities, so as to revise certain laws regarding the carrying of firearms; to provide for a short title; to provide for legislative findings; to provide for related matters; to provide for an effective date; to repeal conflicting laws; and for other purposes. BE IT ENACTED BY THE GENERAL ASSEMBLY OF GEORGIA: H. B. 2 - 1 -  LC 28 9877 SECTION 1. This Act shall be known and may be cited as the \"Georgia Constitutional Carry Act of 2021.\" SECTION 2. The Georgia General Assembly finds that: (1) Our founding fathers, in the unanimous Declaration of Independence of the 13 United States of America, acknowledged that the purpose of civil government is to secure God-given rights; (2) As such, civil governments are to punish the criminal acts that deprive their citizens of their God-given rights to life, liberty, and property; (3) The mere potential to deprive someone of life, liberty, or property should never be considered a crime in a free and just society; (4) Evil resides in the heart of the individual, not in material objects; and (5) Since objects or instrumentalities in and of themselves are not dangerous or evil, in a free and just society, the civil government should not ban or restrict their possession or use. SECTION 3. Article 1 of Chapter 3 of Title 12 of the Official Code of Georgia Annotated, relating to general provisions regarding parks, historic areas, memorials, and recreation, is amended by revising subsection (o) of Code Section 12-3-10, relating to directing persons to leave parks, historic sites, or recreational areas upon their refusal to observe rules and regulations and prohibited acts generally, as follows: \"(o)(1) It shall be unlawful for any person to use or possess in any park, historic site, or recreational area any fireworks, explosives, or firecrackers, unless stored so as not to be readily accessible or unless such use has been approved by prior written permission of the commissioner of natural resources or his or her authorized representative. H. B. 2 - 2 -  LC 28 9877 (2) It shall be unlawful for any person to use or possess in any park, historic site, or recreational area any firearms other than a handgun, as such term is defined in Code Section 16-11-125.1. (3)(2) It shall be unlawful for any person to use or possess in any park, historic site, or recreational area any handgun without a valid weapons carry license issued pursuant to Code Section 16-11-129 weapon or long gun unless such person is a lawful weapons carrier. As used in this paragraph, the terms 'weapon,' 'long gun,' and 'lawful weapons carrier' shall have the same meanings as provided for in Code Section 16-11-125.1. (4)(3) It shall be unlawful for any person to use or possess in any park, historic site, or recreational area any bows and arrows, spring guns, air rifles, slingshots, or any other device which discharges projectiles by any means, unless the device is unloaded and stored so as not to be readily accessible or unless such use has been approved within restricted areas by prior written permission of the commissioner of natural resources or his or her authorized representative.\" SECTION 4. Part 3 of Article 4 of Chapter 11 of Title 16 of the Official Code of Georgia Annotated, relating to carrying and possession of firearms, is amended by revising Code Section 16-11-125.1, relating to definitions, as follows: \"16-11-125.1. As used in this part, the term: (1) 'Handgun' means a firearm of any description, loaded or unloaded, from which any shot, bullet, or other missile can be discharged by an action of an explosive where the length of the barrel, not including any revolving, detachable, or magazine breech, does not exceed 12 inches; provided, however, that the term 'handgun' shall not include a gun which discharges a single shot of 0.46 centimeter or less in diameter. H. B. 2 - 3 -  LC 28 9877 (2) 'Knife' means a cutting instrument designed for the purpose of offense and defense consisting of a blade that is greater than 12 inches in length which is fastened to a handle. (2.1) 'Lawful weapons carrier' means any person who is not prohibited by law from possessing a weapon or long gun, any person who is licensed pursuant to Code Section 16-11-129, or any person licensed to carry a weapon in any other state whose laws recognize and give effect to a license issued pursuant to this part. (3) 'License holder' means a person who holds a valid weapons carry license. (4) 'Long gun' means a firearm with a barrel length of at least 18 inches and overall length of at least 26 inches designed or made and intended to be fired from the shoulder and designed or made to use the energy of the explosive in a fixed: (A) Shotgun shell to fire through a smooth bore either a number of ball shot or a single projectile for each single pull of the trigger or from which any shot, bullet, or other missile can be discharged; or (B) Metallic cartridge to fire only a single projectile through a rifle bore for each single pull of the trigger; provided, however, that the term 'long gun' shall not include a gun which discharges a single shot of 0.46 centimeter or less in diameter. (5) 'Weapon' means a knife or handgun. (6) 'Weapons carry license' or 'license' means a license issued pursuant to Code Section 16-11-129.\" SECTION 5. Said part is further amended by revising Code Section 16-11-126, relating to having or carrying handguns, long guns, or other weapons, license requirement, and exceptions for homes, motor vehicles, private property, and other locations and conditions, as follows: \"16-11-126. H. B. 2 - 4 -  LC 28 9877 (a) Any person who is not prohibited by law from possessing a handgun or long gun may have or carry on his or her person a weapon or long gun on his or her property or inside his or her home, motor vehicle, or place of business without a valid weapons carry license. (b) Any person who is not prohibited by law from possessing a handgun or long gun may have or carry on his or her person a long gun without a valid weapons carry license, provided that if the long gun is loaded, it shall only be carried in an open and fully exposed manner. (c) Any person who is not prohibited by law from possessing a handgun or long gun may have or carry any handgun provided that it is enclosed in a case and unloaded. (d) Any person who is not prohibited by law from possessing a handgun or long gun who is eligible for a weapons carry license may transport a handgun or long gun in any private passenger motor vehicle; provided, however, that private property owners or persons in legal control of private property through a lease, rental agreement, licensing agreement, contract, or any other agreement to control access to such private property shall have the right to exclude or eject a person who is in possession of a weapon or long gun on their private property in accordance with paragraph (3) of subsection (b) of Code Section 16-7-21, except as provided in Code Section 16-11-135. (e)(1)(A) Any person licensed to carry a weapon in any other state whose laws recognize and give effect to a license issued pursuant to this part shall be authorized to carry a weapon in this state, but only while the licensee is not a resident of this state; provided, however, that: (I) Such licensee licensed to carry a weapon in any other state shall carry the weapon in compliance with the laws of this state; and (ii) No other state shall be required to recognize and give effect to a license issued pursuant to this part that is held by a person who is younger than 21 years of age. H. B. 2 - 5 -  LC 28 9877 (B) The Attorney General shall create and maintain on the Department of Law's website a list of states whose laws recognize and give effect to a license issued pursuant to this part. (2) Any person who is not a weapons carry license holder in this state and who is licensed to carry a weapon in any other state whose laws recognize and give effect to a license issued pursuant to this part shall be authorized to carry a weapon in this state for days after he or she becomes a resident of this state; provided, however, that such person shall carry the weapon in compliance with the laws of this state, shall as soon as practicable submit a weapons carry license application as provided for under Code Section 16-11-129, and shall remain licensed in such other state for the duration of time that he or she is a resident of this state but not a weapons carry license holder in this state. (f)(1) Any person with a valid hunting or fishing license on his or her person, or any person not required by law to have a hunting or fishing license, who is engaged in legal hunting, fishing, or sport shooting when the person has the permission of the owner of the land on which the activities are being conducted may have or carry on his or her person a weapon or long gun without a valid weapons carry license while hunting, fishing, or engaging in sport shooting. (2) Any person with a valid hunting or fishing license on his or her person, or any person not required by law to have a hunting or fishing license, who is otherwise engaged in legal hunting, fishing, or sport shooting on recreational or wildlife management areas owned by this state may have or carry on his or her person a knife without a valid weapons carry license while engaging in such hunting, fishing, or sport shooting. (g) Notwithstanding Code Sections 12-3-10, 27-3-1.1, 27-3-6, and 16-12-122 through 16-12-127, any person with a valid weapons carry license may carry a weapon in all parks, historic sites, or recreational areas, as such term is defined in Code Section 12-3-10, including all publicly owned buildings located in such parks, historic sites, and recreational areas, in wildlife management areas, and on public transportation; H. B. 2 - 6 -  LC 28 9877 provided, however, that a person shall not carry a handgun into a place where it is prohibited by federal law. (h)(1) No person shall carry a weapon without a valid weapons carry license unless he or she meets one of the exceptions to having such license as provided in subsections (a) through (g) of this Code section. (2) A person commits the offense of carrying a weapon without a license when he or she violates the provisions of paragraph (1) of this subsection. (I) Upon conviction of the offense of carrying a weapon without a valid weapons carry license, a person shall be punished as follows: (1) For the first offense, he or she shall be guilty of a misdemeanor; and (2) For the second offense within five years, as measured from the dates of previous arrests for which convictions were obtained to the date of the current arrest for which a conviction is obtained, and for any subsequent offense, he or she shall be guilty of a felony and, upon conviction thereof, shall be imprisoned for not less than two years and not more than five years. (j) Nothing in this Code section shall in any way operate or be construed to affect, repeal, or limit the exemptions provided for under Code Section 16-11-130 Reserved.\" SECTION 6. Said part is further amended by revising Code Section 16-11-127, relating to carrying weapons in unauthorized locations, as follows: \"16-11-127. (a) As used in this Code section, the term: (1) 'Courthouse' means a building occupied by judicial courts and containing rooms in which judicial proceedings are held. (2) 'Government building' means: (A) The building in which a government entity is housed; H. B. 2 - 7 -  LC 28 9877 (B) The building where a government entity meets in its official capacity; provided, however, that if such building is not a publicly owned building, such building shall be considered a government building for the purposes of this Code section only during the time such government entity is meeting at such building; or (C) The portion of any building that is not a publicly owned building that is occupied by a government entity. (3) 'Government entity' means an office, agency, authority, department, commission, board, body, division, instrumentality, or institution of the state or any county, municipal corporation, consolidated government, or local board of education within this state. (4) 'Parking facility' means real property owned or leased by a government entity, courthouse, jail, prison, or place of worship that has been designated by such government entity, courthouse, jail, prison, or place of worship for the parking of motor vehicles at a government building or at such courthouse, jail, prison, or place of worship. (b) Except as provided in Code Section 16-11-127.1 and subsection (d) or (e) of this Code section, a person shall be guilty of carrying a weapon or long gun in an unauthorized location and punished as for a misdemeanor when he or she carries a weapon or long gun while: (1) In a government building as a nonlicense holder without being a lawful weapons carrier; (2) In a courthouse; (3) In a jail or prison; (4) In a place of worship, unless the governing body or authority of the place of worship permits the carrying of weapons or long guns by license holders persons who are lawful weapons carriers; (5) In a state mental health facility as defined in Code Section 37-1-1 which admits individuals on an involuntary basis for treatment of mental illness, developmental disability, or addictive disease; provided, however, that carrying a weapon or long gun H. B. 2 - 8 -  LC 28 9877 in such location in a manner in compliance with paragraph (3) of subsection (d) of this Code section shall not constitute a violation of this subsection; (6) On the premises of a nuclear power facility, except as provided in Code Section 16-11-127.2, and the punishment provisions of Code Section 16-11-127.2 shall supersede the punishment provisions of this Code section; or (7) Within 150 feet of any polling place when elections are being conducted and such polling place is being used as a polling place as provided for in paragraph (27) of Code Section 21-2-2, except as provided in subsection (I) of Code Section 21-2-413. (c) A license holder or person recognized under subsection (e) of Code Section 16-11-126 Any lawful weapons carrier shall be authorized to carry a weapon as provided in Code Section 16-11-135 and in every location in this state not listed in subsection (b) or prohibited by subsection (e) of this Code section; provided, however, that private property owners or persons in legal control of private property through a lease, rental agreement, licensing agreement, contract, or any other agreement to control access to such private property shall have the right to exclude or eject a person who is in possession of a weapon or long gun on their his or her private property in accordance with paragraph (3) of subsection (b) of Code Section 16-7-21, except as provided in Code Section 16-11-135. A violation of subsection (b) of this Code section shall not create or give rise to a civil action for damages. (d) Subsection (b) of this Code section shall not apply: (1) To the use of weapons or long guns as exhibits in a legal proceeding, provided that such weapons or long guns are secured and handled as directed by the personnel providing courtroom security or the judge hearing the case; (2) To a license holder lawful weapons carrier who approaches security or management personnel upon arrival at a location described in subsection (b) of this Code section and notifies such security or management personnel of the presence of the weapon or long H. B. 2 - 9 -  LC 28 9877 gunandexplicitlyfollowsthesecurityormanagementpersonnel'sdirectionforremoving, securing, storing, or temporarily surrendering such weapon or long gun; and (3) To a weapon or long gun possessed by a license holder lawful weapons carrier which is under the possessor's control in a motor vehicle or is in a locked compartment of a motor vehicle or one which is in a locked container in or a locked firearms rack which is on a motor vehicle and such vehicle is parked in a parking facility. (e)(1) A license holder lawful weapons carrier shall be authorized to carry a weapon in a government building when the government building is open for business and where ingress into such building is not restricted or screened by security personnel. A license holder lawful weapons carrier who enters or attempts to enter a government building carrying a weapon where ingress is restricted or screened by security personnel shall be guilty of a misdemeanor if at least one member of such security personnel is certified as a peace officer pursuant to Chapter 8 of Title 35; provided, however, that a license holder lawful weapons carrier who immediately exits such building or immediately leaves such location upon notification of his or her failure to clear security due to the carrying of a weapon shall not be guilty of violating this subsection or paragraph (1) of subsection (b) of this Code section. A person who is not a license holder lawful weapons carrier and who attempts to enter a government building carrying a weapon shall be guilty of a misdemeanor. (2) Any license holder lawful weapons carrier who violates subsection (b) of this Code section in a place of worship shall not be arrested but shall be fined not more than $100.00. Any person who is not a license holder lawful weapons carrier who violates subsection (b) of this Code section in a place of worship shall be punished as for a misdemeanor. (f) Nothing in this Code section shall in any way operate or be construed to affect, repeal, or limit the exemptions provided for under Code Section 16-11-130.\" H. B. 2 - 10 -  LC 28 9877 SECTION 7. Said part is further amended by revising paragraph (2) of subsection (b) and paragraphs (7), (8), and (20) of subsection (c) of Code Section 16-11-127.1, relating to carrying weapons within school safety zones, at school functions, or on a bus or other transportation furnished by a school, as follows: \"(2) Except as provided for in paragraph (20) of subsection (c) of this Code section, any license holder lawful weapons carrier who violates this subsection shall be guilty of a misdemeanor. Any person who is not a license holder lawful weapons carrier who violates this subsection shall be guilty of a felony and, upon conviction thereof, be punished by a fine of not more than $10,000.00, by imprisonment for not less than two nor more than ten years, or both.\" \"(7) A person who is licensed in accordance with Code Section 16-11-129 or issued a permit pursuant to Code Section 43-38-10, lawful weapons carrier when such person carries or picks up a student within a school safety zone, at a school function, or on a bus or other transportation furnished by a school or a person who is licensed in accordance with Code Section 16-11-129 or issued a permit pursuant to Code Section 43-38-10 lawful weapons carrier when he or she has any weapon legally kept within a vehicle when such vehicle is parked within a school safety zone or is in transit through a designated school safety zone; (8) A weapon possessed by a license holder lawful weapons carrier which is under the possessor's control in a motor vehicle or which is in a locked compartment of a motor vehicle or one which is in a locked container in or a locked firearms rack which is on a motor vehicle which is being used by an adult over 21 years of age to bring to or pick up a student within a school safety zone, at a school function, or on a bus or other transportation furnished by a school, or when such vehicle is used to transport someone to an activity being conducted within a school safety zone which has been authorized by a duly authorized official or local board of education as provided by paragraph (6) of this H. B. 2 - 11 -  LC 28 9877 subsection; provided, however, that this exception shall not apply to a student attending a public or private elementary or secondary school;\" \"(20)(A) Any weapons carry license holder lawful weapons carrier when he or she is in any building or on real property owned by or leased to any public technical school, vocational school, college, or university, or other public institution of postsecondary education; provided, however, that such exception shall: (I) Not apply to buildings or property used for athletic sporting events or student housing, including, but not limited to, fraternity and sorority houses; (ii) Not apply to any preschool or childcare space located within such buildings or real property; (iii) Not apply to any room or space being used for classes related to a college and career academy or other specialized school as provided for under Code Section 20-4-37; (iv) Not apply to any room or space being used for classes in which high school students are enrolled through a dual enrollment program, including, but not limited to, classes related to the 'Dual Enrollment Act' as provided for under Code Section 20-2-161.3; (v) Not apply to faculty, staff, or administrative offices or rooms where disciplinary proceedings are conducted; and (vi) Only apply to the carrying of handguns which a licensee is licensed to carry pursuant to subsection (e) of Code Section 16-11-126 and pursuant to Code Section 16-11-129; and (vii) Only apply to the carrying of handguns which are concealed. (B) Any weapons carry license holder lawful weapons carrier who carries a handgun in a manner or in a building, property, room, or space in violation of this paragraph shall be guilty of a misdemeanor; provided, however, that for a conviction of a first H. B. 2 - 12 -  LC 28 9877 offense, such weapons carry license holder lawful weapons carrier shall be punished by a fine of $25.00 and not be sentenced to serve any term of confinement. (C) As used in this paragraph, the term: (I) 'Concealed' means carried in such a fashion that does not actively solicit the attention of others and is not prominently, openly, and intentionally displayed except for purposes of defense of self or others. Such term shall include, but not be limited to, carrying on one's person while such handgun is substantially, but not necessarily completely, covered by an article of clothing which is worn by such person, carrying within a bag of a nondescript nature which is being carried about by such person, or carrying in any other fashion as to not be clearly discernible by the passive observation of others. (ii) 'Preschool or childcare space' means any room or continuous collection of rooms or any enclosed outdoor facilities which are separated from other spaces by an electronic mechanism or human-staffed point of controlled access and designated for the provision of preschool or childcare services, including, but not limited to, preschool or childcare services licensed or regulated under Article 1 of Chapter 1A of Title 20.\" SECTION 8. Said part is further amended by revising subparagraph (b)(2)(H) of Code Section 16-11-129, relating to weapons carry license, gun safety information, temporary renewal permit, mandamus, and verification of license, as follows: \"(H) Any person who has been convicted of any of the following: (I) Carrying a weapon without a weapons carry license in violation of Code Section 16-11-126; or (ii) Carrying carrying a weapon or long gun in an unauthorized location in violation of Code Section 16-11-127 H. B. 2 - 13 -  LC 28 9877 and has not been free of all restraint or supervision in connection therewith and free of any other conviction for at least five years immediately preceding the date of the application;\" SECTION 9. Said part is further amended by revising Code Section 16-11-130, relating to exemptions from Code Sections 16-11-126 through 16-11-127.2, as follows: \"16-11-130. (a) Except to the extent provided for in subsection (c.1) of this Code section, Code Sections 16-11-126 16-11-127 through 16-11-127.2 shall not apply to or affect any of the following persons if such persons are employed in the offices listed below or when authorized by federal or state law, regulations, or order: (1) Peace officers, as such term is defined in paragraph (11) of Code Section 16-1-3, and retired peace officers so long as they remain certified whether employed by the state or a political subdivision of the state or another state or a political subdivision of another state but only if such other state provides a similar privilege for the peace officers of this state; (2) Wardens, superintendents, and keepers of correctional institutions, jails, or other institutions for the detention of persons accused or convicted of an offense; (3) Persons in the military service of the state or of the United States; (4) Persons employed in fulfilling defense contracts with the government of the United States or agencies thereof when possession of the weapon or long gun is necessary for manufacture, transport, installation, and testing under the requirements of such contract; (5) District attorneys, investigators employed by and assigned to a district attorney's office, assistant district attorneys, attorneys or investigators employed by the Prosecuting Attorneys' Council of the State of Georgia, and any retired district attorney, assistant district attorney, district attorney's investigator, or attorney or investigator retired from H. B. 2 - 14 -  LC 28 9877 the Prosecuting Attorneys' Council of the State of Georgia, if such employee is retired in good standing and is receiving benefits under Title 47 or is retired in good standing and receiving benefits from a county or municipal retirement system; (6) State court solicitors-general; investigators employed by and assigned to a state court solicitor-general's office; assistant state court solicitors-general; the corresponding personnel of any city court expressly continued in existence as a city court pursuant to Article VI, Section X, Paragraph I, subparagraph (5) of the Constitution; and the corresponding personnel of any civil court expressly continued as a civil court pursuant to said provision of the Constitution; (7) Those employees of the State Board of Pardons and Paroles when specifically designated and authorized in writing by the members of the State Board of Pardons and Paroles to carry a weapon or long gun; (8) The Attorney General and those members of his or her staff whom he or she specifically authorizes in writing to carry a weapon or long gun; (9) Community supervision officers employed by and under the authority of the Department of Community Supervision when specifically designated and authorized in writing by the commissioner of community supervision; (10) Public safety directors of municipal corporations; (11) Explosive ordnance disposal technicians, as such term is defined by Code Section 16-7-80, and persons certified as provided in Code Section 35-8-13 35-8-25 to handle animals trained to detect explosives, while in the performance of their duties; (12) Federal judges, Justices of the Supreme Court, Judges of the Court of Appeals, judges of superior, state, probate, juvenile, and magistrate courts, full-time judges of municipal and city courts, permanent part-time judges of municipal and city courts, and administrative law judges; (12.1) Former federal judges, Justices of the Supreme Court, Judges of the Court of Appeals, judges of superior, state, probate, juvenile, and magistrate courts, full-time H. B. 2 - 15 -  LC 28 9877 judges of municipal and city courts, permanent part-time judges of municipal courts, and administrativelawjudgeswhoareretiredfromtheirrespectiveoffices, providedthatsuch judge or Justice would otherwise be qualified to be issued a weapons carry license; (12.2) Former federal judges, Justices of the Supreme Court, Judges of the Court of Appeals, judges of superior, state, probate, juvenile, and magistrate courts, full-time judges of municipal and city courts, permanent part-time judges of municipal courts, and administrative law judges who are no longer serving in their respective office, provided that he or she served as such judge or Justice for more than 24 months; and provided, further, that such judge or Justice would otherwise be qualified to be issued a weapons carry license; (13) United States Attorneys and Assistant United States Attorneys; (14) County medical examiners and coroners and their sworn officers employed by county government; (15) Clerks of the superior courts; and (16) Constables employed by a magistrate court of this state. (b) Except to the extent provided for in subsection (c.1) of this Code section, Code Sections 16-11-126 16-11-127 through 16-11-127.2 shall not apply to or affect persons who at the time of their retirement from service with the Department of Community Supervision were community supervision officers, when specifically designated and authorized in writing by the commissioner of community supervision. (c)(1) As used in this subsection, the term 'courthouse' means a building or annex occupied by judicial courts and containing rooms in which judicial proceedings are held. (2) Except to the extent provided for in subsection (c.1) of this Code section, Code Sections 16-11-126 16-11-127 through 16-11-127.2 shall not apply to or affect any: (A) Sheriff, retired sheriff, deputy sheriff, or retired deputy sheriff if such retired sheriff or deputy sheriff is eligible to receive or is receiving benefits under the Peace Officers' Annuity and Benefit Fund provided under Chapter 17 of Title 47, the Sheriffs' H. B. 2 - 16 -  LC 28 9877 Retirement Fund of Georgia provided under Chapter 16 of Title 47, or any other public retirement system established under the laws of this state for service as a law enforcement officer; (B) Member of the Georgia State Patrol, agent of the Georgia Bureau of Investigation, retired member of the Georgia State Patrol, or retired agent of the Georgia Bureau of Investigation if such retired member or agent is receiving benefits under the Employees' Retirement System; (C) Full-time law enforcement chief executive engaging in the management of a county, municipal, state, state authority, or federal law enforcement agency in the State of Georgia, including any college or university law enforcement chief executive who is registered or certified by the Georgia Peace Officer Standards and Training Council; or retired law enforcement chief executive who formerly managed a county, municipal, state, state authority, or federal law enforcement agency in the State of Georgia, includinganycollegeoruniversitylawenforcementchiefexecutivewhowasregistered or certified at the time of his or her retirement by the Georgia Peace Officer Standards and Training Council, if such retired law enforcement chief executive is receiving benefits under the Peace Officers'Annuity and Benefit Fund provided under Chapter 17 of Title 47 or is retired in good standing and receiving benefits from a county, municipal, State of Georgia, state authority, or federal retirement system; (D) Police officer of any county, municipal, state, state authority, or federal law enforcement agency in the State of Georgia, including any college or university police officer who is registered or certified by the Georgia Peace Officer Standards and Training Council, or retired police officer of any county, municipal, state, state authority, or federal law enforcement agency in the State of Georgia, including any college or university police officer who was registered or certified at the time of his or her retirement by the Georgia Peace Officer Standards and Training Council, if such retiredpoliceofficerisreceivingbenefitsunderthePeaceOfficers'AnnuityandBenefit H. B. 2 - 17 -  LC 28 9877 Fund provided under Chapter 17 of Title 47 or is retired in good standing and receiving benefits from a county, municipal, State of Georgia, state authority, or federal retirement system; or (E) Person who is a citizen of this state and: (I) Has retired with at least ten years of aggregate service as a law enforcement officer with powers of arrest under the laws of any state of the United States or of the United States; (ii) Separated from service in good standing, as determined by criteria established by the Georgia Peace Officer Standards and Training Council, from employment with his or her most recent law enforcement agency; and (iii) Possesses on his or her person an identification card for retired law enforcement officers as issued by the Georgia Peace Officer Standards and Training Council; provided, however, that such person meets the standards for the issuance of such card as provided for by the council, including, but not limited to, maintenance of qualification in firearms training. Inaddition, anysuchsheriff, retiredsheriff, deputysheriff, retireddeputysheriff, member or retired member of the Georgia State Patrol, agent or retired agent of the Georgia BureauofInvestigation, officerorretiredofficeroftheDepartmentofNaturalResources, active or retired law enforcement chief executive, person who is a retired law enforcement officer as provided for in paragraph (2) of this subsection, or other law enforcement officer referred to in this subsection shall be authorized to carry a handgun on or off duty anywhere within this state, including, but not limited to, in a courthouse except to the extent provided for in subsection (c.1) of this Code section, and Code Sections 16-11-126 16-11-127 through 16-11-127.2 shall not apply to the carrying of such firearms. (c.1)(1) As used in the subsection, the term: (A) 'Active' means nonretired. H. B. 2 - 18 -  LC 28 9877 (B) 'Courthouse' means a building or annex occupied by judicial courts and containing rooms in which judicial proceedings are held. (C) 'Law enforcement agency' means sheriffs or any unit, organ, or department of this state, or a subdivision or municipality thereof, whose functions by law include the enforcement of criminal or traffic laws; the preservation of public order; the protection of life and property; the prevention, detection, or investigation of crime; or court security that is providing security for a courthouse. (D) 'Law enforcement personnel' means sheriffs or deputy sheriffs or peace officers employed by a law enforcement agency. (2)(A) Pursuant to a security plan implemented by law enforcement personnel, including as provided for under a comprehensive plan as provided for in subsection (a) of Code Section 15-16-10, the law enforcement agency with jurisdiction over a courthouse may provide for facilities or the means for the holding of weapons carried by persons enumerated under this Code section, except as provided for in paragraph (3) of this subsection, provided that ingress to such courthouse is actively restricted or screened by law enforcement personnel and such facilities or means are located in the immediate proximity of the area which is restricted or screened by such law enforcement personnel. (B) If the requirements of this paragraph are met, the persons enumerated under this Code section shall, except as provided for in paragraph (3) of this subsection, upon request of law enforcement personnel place his or her weapons in such holding with law enforcement personnel while such persons are within the restricted or screened area. Upon request of any person enumerated under this Code section, in preparation for his or her exit from the restricted or screened area, law enforcement personnel shall immediately provide for the return of the person's weapons which are in holding. (3) Notwithstanding a security plan implemented by law enforcement personnel, including as provided for under a comprehensive plan as provided for in subsection (a) H. B. 2 - 19 -  LC 28 9877 of Code Section 15-16-10, active law enforcement officers referred to in subsection (c) of this Code section shall be authorized to carry their service handguns and weapons in any courthouse if they are wearing the assigned uniform of their law enforcement office or have the official badge and identification credentials issued to them by their law enforcement office displayed and plainly visible on their person while in the performance of their official duties. (d) A prosecution based upon a violation of Code Section 16-11-126 or 16-11-127 need not negative any exemptions.\" SECTION 10. Said part is further amended by revising subsection (b) of Code Section 16-11-135, relating to public or private employer's parking lots, right of privacy in vehicles in employer's parking lot or invited guests on lot, severability, and rights of action, as follows: \"(b) Except as provided in this Code section, no private or public employer, including the state and its political subdivisions, shall condition employment upon any agreement by a prospective employee that prohibits an employee from entering the parking lot and access thereto when the employee's privately owned motor vehicle contains a firearm or ammunition, or both, that is locked out of sight within the trunk, glove box, or other enclosed compartment or area within such privately owned motor vehicle, provided that any applicable employees possess a Georgia weapons carry license such prospective employee is a lawful weapons carrier.\" SECTION 11. Said part is further amended by revising Code Section 16-11-137, relating to required possession of weapons carry license or proof of exemption when carrying a weapon and detention for investigation of carrying permit, as follows: \"16-11-137. H. B. 2 - 20 -  LC 28 9877 (a) Every license holder shall have his or her valid weapons carry license in his or her immediate possession at all times when carrying a weapon, or if such person is exempt from having a weapons carry license pursuant to Code Section 16-11-130 or subsection (c) of Code Section 16-11-127.1, he or she shall have proof of his or her exemption in his or her immediate possession at all times when carrying a weapon, and his or her failure to do so shall be prima-facie evidence of a violation of the applicable provision of Code Sections 16-11-126 through 16-11-127.2. (b) A person carrying a weapon shall not be subject to detention for the sole purpose of investigating whether such person has a weapons carry license, whether such person is exempt from having a weapons carry license pursuant to Code Section 16-11-130 or subsection (c) of Code Section 16-11-127.1, or whether such person is a lawful weapons carrier as defined in Code Section 16-11-125.1. (c) A person convicted of a violation of this Code section shall be fined not more than $10.00 if he or she produces in court his or her weapons carry license, provided that it was valid at the time of his or her arrest, or produces proof of his or her exemption.\" SECTION 12. Part 2 of Article 4 of Chapter 12 of Title 16 of the Official Code of Georgia Annotated, relating to transportation passenger safety, is amended by revising subsection (b) of Code Section16-12-123, relatingtobusorrailvehiclehijacking, boardingwithconcealedweapon, and company use of reasonable security measures, as follows: \"(b) Any person who boards or attempts to board an aircraft, bus, or rail vehicle with any explosive, destructive device, or hoax device as such term is terms are defined in Code Section 16-7-80; firearm for which weapon or long gun as such terms are defined in Code Section 16-11-125.1 if such person does not have on his or her person a valid weapons carry license issued pursuant to Code Section 16-11-129 unless possessing such firearm is prohibited by federal law is not a lawful weapons carrier as defined in Code H. B. 2 - 21 -  LC 28 9877 Section 16-11-125.1; hazardous substance as defined by Code Section 12-8-92; or knife or other device designed or modified for the purpose of offense and defense concealed on or about his or her person or property which is or would be accessible to such person while on the aircraft, bus, or rail vehicle shall be guilty of a felony and, upon conviction thereof, shall be sentenced to imprisonment for not less than one nor more than ten years. The prohibition of this subsection shall not apply to any law enforcement officer, peace officer retired from a state or federal law enforcement agency, person in the military service of the state or of the United States, or commercial security personnel employed by the transportation company who is in possession of weapons used within the course and scope of employment; nor shall the prohibition apply to persons transporting weapons contained in baggage which is not accessible to passengers if the presence of such weapons has been declared to the transportation company and such weapons have been secured in a manner prescribed by state or federal law or regulation for the purpose of transportation or shipment. The provisions of this subsection shall not apply to any privately owned aircraft, bus, or rail vehicle if the owner of such aircraft or vehicle has given his or her express permission to board the aircraft or vehicle with the item.\" SECTION 13. Said part is further amended by revising subsection (a) of Code Section 16-12-127, relating to prohibition on firearms, hazardous substances, knives, or other devices, penalty, and affirmative defenses, as follows: \"(a) It shall be unlawful for any person, with the intention of avoiding or interfering with a security measure or of introducing into a terminal any explosive, destructive device, or hoax device as such terms are defined in Code Section 16-7-80; firearm for which such person does not have on his or her person a valid weapons carry license issued pursuant to Code Section 16-11-129 unless possessing such firearm is prohibited by federal law weapon or long gun as such terms are defined in Code Section 16-11-125.1 if such person H. B. 2 - 22 -  LC 28 9877 is not a lawful weapons carrier as defined in Code Section 16-11-125.1; hazardous substance as defined by Code Section 12-8-92; or knife or other device designed or modified for the purpose of offense and defense, to: (1) Have any such item on or about his or her person,; or (2) Place or cause to be placed or attempt to place or cause to be placed any such item: (A) In a container or freight of a transportation company; (B) In the baggage or possessions of any person or any transportation company without the knowledge of the passenger or transportation company; or (C) Aboard such aircraft, bus, or rail vehicle.\" SECTION 14. Title 27 of the Official Code of Georgia Annotated, relating to game and fish, is amended by revising paragraphs (1) and (2) of Code Section 27-3-1.1, relating to acts prohibited on wildlife management areas, as follows: \"(1) To possess a firearm other than a handgun, as such term is defined in Code Section 16-11-125.1, during a closed hunting season for that area unless such firearm is unloaded and stored in a motor vehicle so as not to be readily accessible or to possess a handgun during a closed hunting season for that area unless such person possesses a valid weapons carry license issued pursuant to Code Section 16-11-129 is a lawful weapons carrier as defined in Code Section 16-11-125.1; (2) To possess a loaded firearm other than a handgun, as such term is defined in Code Section 16-11-125.1, in a motor vehicle during a legal open hunting season for that area or to possess a loaded handgun in a motor vehicle during a legal open hunting season for that area unless such person possesses a valid weapons carry license issued pursuant to Code Section 16-11-129 is a lawful weapons carrier as defined in Code Section -11-125.1;\". H. B. 2 - 23 -  LC 28 9877 SECTION 15. Said title is further amended by revising Code Section 27-3-6, relating to possession of firearm while hunting with bow and arrow, as follows: \"27-3-6. It shall be unlawful for any person to possess any center-fire or rimfire firearm other than a handgun, as such term is defined in Code Section 16-11-125.1, while hunting with a bow and arrow during archery or primitive weapons season for deer or while hunting with a muzzleloading firearm during a primitive weapons season for deer or to possess a loaded handgun while hunting with a bow and arrow during archery or primitive weapons season for deer or while hunting with a muzzleloading firearm during primitive weapons season for deer unless such person possesses a valid weapons carry license issued pursuant to Code Section 16-11-129 is a lawful weapons carrier as defined in Code Section 16-11-125.1.\" SECTION 16. Said title is further amended by revising paragraphs (1) and (2) of subsection (a) of Code Section 27-4-11.1, relating to possession of firearms and intoxication on public fishing areas, fishing in closed fishing areas, and other restrictions in public fishing areas, as follows: \"(1) To possess a firearm other than a handgun, as such term is defined in Code Section 16-11-125.1, during a closed hunting season for that area unless such firearm is unloaded and stored in a motor vehicle so as not to be readily accessible or to possess a handgun during a closed hunting season for that area unless such person possesses a valid weapons carry license issued pursuant to Code Section 16-11-129 is a lawful weapons carrier as defined in Code Section 16-11-125.1; (2) To possess a loaded firearm other than a handgun, as such term is defined in Code Section 16-11-125.1, in a motor vehicle during a legal open hunting season for that area or to possess a loaded handgun in a motor vehicle during a legal open hunting season for H. B. 2 - 24 -  LC 28 9877 that area unless such person possesses a valid weapons carry license issued pursuant to Code Section 16-11-129 is a lawful weapons carrier as defined in Code Section -11-125.1; or\". SECTION 17. Part 2 of Article 10 of Chapter 6 of Title 40 of the Official Code of Georgia Annotated, relating to parking for persons with disabilities, is amended by revising paragraph (4) of subsection (b) of Code Section 40-6-228, relating to enforcement of parking for persons with disabilities, as follows: \"(4) Have the power to possess and carry firearms and other weapons for the purpose of enforcing the parking laws for persons with disabilities; provided, however, that a person who possesses a valid weapons carry license issued under Code Section 16-11-129 and who carries such weapon in a manner permitted under Code Section 16-11-126 is a lawful weapons carrier as defined in Code Section 16-11-125.1 shall not be in violation of this paragraph; or\". SECTION 18. This Act shall become effective upon its approval by the Governor or upon its becoming law without such approval. SECTION 19. All laws and parts of laws in conflict with this Act are repealed. H. B. 2 - 25 -"}