{"legislative_id": 58795, "legislative_title": "Support for Students Living in Poverty Act; enact", "document_text": "LC 49 0262 House Bill 10 By: Representatives Scott of the 76th, Beverly of the 143rd, Burnough of the 77th, Schofield of the 60th, McLeod of the 105th, and others A BILL TO BE ENTITLED AN ACT To amend Part 5 of Article 6 of Chapter 2 of Title 20 of the Official Code of Georgia Annotated, relating to program weights and funding requirements under the \"Quality Basic Education Act,\" so as to provide for grants by the State Board of Education to local units of administration to support students living in poverty; to provide for definitions; to require the State Board of Education to develop rules and regulations; to provide for the calculation of grant amounts; to provide that a minimum required portion of grant funds must be used by local units of administration for direct program expenditures for the benefit of the students living in poverty; to provide for a short title; to provide for related matters; to repeal conflicting laws; and for other purposes. BE IT ENACTED BY THE GENERAL ASSEMBLY OF GEORGIA: SECTION 1. This Act shall be known and may be cited as the \"Support for Students Living in Poverty Act.\" H. B. 10 - 1 -  LC 49 0262 SECTION 2. Part 5 of Article 6 of Chapter 2 of Title 20 of the Official Code of Georgia Annotated, relating to program weights and funding requirements under the \"Quality Basic Education Act,\" is amended by revising Code Section 20-2-189, relating to migrant student grants for schools, as follows: \"20-2-189. (a) As used in this Code section, the term: (1) 'Foster care student' means a student enrolled in a public school who is placed in a foster family home, child care institution, or another substitute care setting approved by the Department of Human Services. (2) 'Homeless student' means a student enrolled in a public school who meets the definition of the term 'homeless children and youths' under the McKinney-Vento Homeless Assistance Act, codified at 42 U.S.C. Section 11301, et seq., in force and effect on January 1, 2021. (3) 'Migrant student' means 'migrant student' means a child who is a student enrolled in a public school and who has, within 12 months prior to first becoming a student in such school, moved across state or school district lines with a migrant parent or guardian to enable the child, the child's parent or guardian, or a member of the child's immediate family to obtain temporary or seasonal employment in an agricultural or fishing activity. (4) 'Student living in poverty' means a student enrolled in a public school who meets one or more of the following criteria: (A) Lives in a family unit directly certified to be receiving SNAP (Food Stamp) benefits; (B) Lives in a family unit directly certified to be receiving TANF benefits; (C) Is a homeless student; (D) Is a foster care student; or (E) Is a migrant student. H. B. 10 - 2 -  LC 49 0262 (b) The State Board of Education shall provide grants to qualified local units of administration for the purpose of supplementing services and instruction to currently enrolled migrant students living in poverty, subject to appropriation by the General Assembly. Such grants shall be provided beyond those funds to which local units of administration otherwise are entitled by the provisions of this article and other statutes. The State Department Board of Education by regulation shall establish rules and regulations relating to the manner in which a local unit of administration must demonstrate that any of its schools meets the eligibility requirements of this subsection it is eligible to receive a grant under this Code section. (c) Grants under this Code section shall be subject to appropriation by the General Assembly. The Department of Education shall calculate the grant amount for a each local unit of administration to be used for a school thereof under this Code section shall be determined by multiplying the total appropriation for such grants by a fraction, the numerator of which is the average number of eligible migrant students enrolling in that school after the final FTE count as required in subsection (a) of Code Section 20-2-160 but prior to the end of the same academic year and the denominator of which is the average total number of eligible migrant students enrolling after the final FTE count as required in subsection (a) of Code Section 20-2-160 but prior to the end of the same academic year in all local units in the entire state number of students living in poverty enrolled in such local unit of administration as of the date of the initial enrollment count each year as set forth in Code Section 20-2-160 by an amount equal to 25 percent of the base amount calculated as set forth in Code Section 20-2-161. At least 90 percent of the grant funds received by a local unit under this Code section shall be used for direct program expenditures at the school for the benefit of the students living in poverty for which the grant is computed under this subsection Code section. Any portion of that 90 percent not so expended shall be returned to the State Department Board of Education.\" H. B. 10 - 3 -  LC 49 0262 SECTION 3. All laws and parts of laws in conflict with this Act are repealed. H. B. 10 - 4 -"}