{"legislative_id": 58793, "legislative_title": "Postsecondary education; institutions deposit a portion of all revenue from its athletic teams into an account to be distributed to eligible student athletes upon graduation; provide", "document_text": "LC 49 0255 House Bill 8 By: Representative Scott of the 76th A BILL TO BE ENTITLED AN ACT To amend Chapter 3 of Title 20 of the Official Code of Georgia Annotated, relating to postsecondary education, so as to provide that postsecondary educational institutions shall deposit a portion of all revenue derived from its athletic teams' involvement with intercollegiatepostseasonathleticcontestsintoanescrowaccounttobe distributed toeligible student athletes on a pro rata basis upon graduation; to provide for definitions; to provide legislative findings and intent; to provide for related matters; to provide for an effective date; to repeal conflicting laws; and for other purposes. BE IT ENACTED BY THE GENERAL ASSEMBLY OF GEORGIA: SECTION 1. (a) The General Assembly finds that student athletes invest much time, effort, and focus on their athletic pursuits, which contribute to opportunities for their athletic teams to represent their postsecondary educational institutions in intercollegiate postseason athletic contests, suchasbowlgames, championships, playoffs, tournaments, andothersimilaractivities, some of which result in significant financial benefits for the student athlete's postsecondary educationalinstitution, andforcoachesandotherpersonnelofthepostsecondaryeducational H. B. 8 - 1 -  LC 49 0255 institution, but which do not necessarily result in financial benefits for the student athletes themselves. (b) The intent of this Act is to promote graduation from postsecondary educational institutions and to provide a means for student athletes to receive appropriate and proper financial benefits for their contributions when their athletic teams represent their postsecondary educational institutions in intercollegiate postseason athletic contests. SECTION 2. Chapter 3 of Title 20 of the Official Code of Georgia Annotated, relating to postsecondary education, is amended by adding a new article to read as follows: \"ARTICLE 13 -3-680. As used in this article, the term: (1) 'Intercollegiate postseason athletic contest'means any intercollegiate athletic contest, duel, game, match, meet, or other similar activity which occurs after and in addition to the regular season. (2) 'Postsecondary educational institution' means a school which is: (A) A unit of the University System of Georgia; (B) A unit of the Technical College System of Georgia; or (C) An independent or private college or university located in Georgia and eligible to be deemed an 'approved school' pursuant to paragraph (2) of Code Section 20-3-411. (3) 'Student athlete' means a person enrolled at a postsecondary educational institution who engages or is eligible to engage in any intercollegiate athletic program at such institution. H. B. 8 - 2 -  -3-681. LC 49 0255 (a) Each postsecondary educational institution for which an athletic team represents such postsecondary educational institution in an intercollegiate postseason athletic contest shall deposit into an escrow account dedicated for such purpose an amount equal to 33 percent of all revenue received by the postsecondary educational institution, from all sources, for being invited or allowed to participate in, for participating in, or for winning any intercollegiatepostseasonathleticcontest. Suchdepositsshallbenotbecalculatedormade sooner than 45 days or later than 90 days after the date of each intercollegiate postseason athletic contest. (b) Upon graduation from a postsecondary educational institution, each student athlete shall be paid from the escrow account provided for in subsection (a) of this Code section his or her pro rata share of the deposit made for each intercollegiate postseason athletic contest for which such student athlete was in good standing and eligible to participate at the time of such intercollegiate postseason athletic contest.\" SECTION 3. This Act shall become effective on July 1, 2021. SECTION 4. All laws and parts of laws in conflict with this Act are repealed. H. B. 8 - 3 -"}