{"legislative_id": 58794, "legislative_title": "Education, Department of; develop guidelines for use of telehealth services in public schools", "document_text": "LC 49 0261 House Bill 9 By: Representatives Scott of the 76th, Hutchinson of the 107th, Schofield of the 60th, McLeod of the 105th, and Davis of the 87th A BILL TO BE ENTITLED AN ACT To amend Part 3 of Article 16 of Chapter 2 of Title 20 of the Official Code of Georgia Annotated, relating to the health of students generally, so as to require the Department of Education, in consultation with the Department of Behavioral Health and Developmental Disabilities and others, to develop guidelines for the use of telehealth services in public schools to provide mental health and behavioral health services to students at school or during any school related function; to define the term \"telehealth\"; to provide for related matters; to repeal conflicting laws; and for other purposes. BE IT ENACTED BY THE GENERAL ASSEMBLY OF GEORGIA: SECTION 1. Part 3 of Article 16 of Chapter 2 of Title 20 of the Official Code of Georgia Annotated, relating to the health of students generally, is amended by revising Code Section 20-2-779.1, relating to suicide prevention and awareness training and no duty of care imposed, as follows: \"20-2-779.1. (a)(1) The Department of Education shall adopt rules to require that all certificated public school personnel receive annual training in suicide awareness and prevention. H. B. 9 - 1 -  LC 49 0261 This training shall be provided within the framework of existing in-service training programs offered by the Department of Education or as part of required professional development offered by a local school system. (2)(A) The Department of Education shall, in consultation with the Department of Behavioral Health and Developmental Disabilities, the Suicide Prevention Program established pursuant to Code Section 37-1-27, and suicide prevention experts, develop a list of approved training materials to fulfill the requirements of this subsection which may include training materials currently being used by a local school system if such training materials meet any criteria established by the department. (3)(B) Approved materials shall include training on how to identify appropriate mental health services, both within the school and also within the larger community, and when and how to refer youth and their families to those services. (4)(C) Approved materials may include programs that can be completed through self-review of suitable suicide prevention materials. (3) To assist local school systems in developing their own policies for student suicide prevention, the Department of Education, in consultation with the Suicide Prevention Program within the Department of Behavioral Health and Developmental Disabilities, shall establish a model policy for use by local school systems in accordance with this Code section. (4)(A) As used in this Code section, the term 'telehealth' means the services provided by a health care provider through the use of information and communications technologies, including, but not limited to, telephones, remote patient monitoring devices, or other electronic means to facilitate the assessment, diagnosis, consultation, treatment, education, care management, and self-management of a student's health care when the health care provider is at a remote location and the student is at a school or is participating in any school related function. H. B. 9 - 2 -  LC 49 0261 (B) The Department of Education, in consultation with the Department of Behavioral Health and Developmental Disabilities, and appropriate stakeholders, including stakeholders with experience in telehealth, shall, on or before October 1, 2021, develop guidelines for the use of such services in public schools to provide mental health and behavioral health services to students at school or during any school related function. (C) The guidelines developed pursuant to this paragraph shall include, but are not limited to, guidance on all of the following: (i) Qualifications of individuals authorized, within the scope of their practice, to assist students in accessing mental health and behavioral health services via telehealth while at school or during any school related function; (ii) Qualifications of individuals authorized to provide mental health and behavioral health services, within their scope of practice, to students via telehealth; (iii) The legal requirements for parental consent for the provision of mental health and behavioral health treatment of a minor via telehealth; (iv) Measures necessary to protect the security of data transmitted during the provision of telehealth; (v) Measures necessary to protect the privacy of student data pursuant to Article 15 of this chapter and the federal Family Educational Rights and Privacy Act (FERPA), U.S.C. Sec. 1232g, and medical records pursuant to the federal Health Insurance Portability and Accountability Act (HIPAA), P.L. 104-191; and (vi) Potential liability for public schools and local school systems associated with the provision of telehealth to students. (5)(A)(b) Each local school system shall adopt a policy on student suicide prevention. Such policies shall be developed in consultation with school and community stakeholders, school employed mental health professionals, and suicide prevention experts, and shall, at a minimum, address procedures relating to suicide prevention, intervention, and postvention. H. B. 9 - 3 -  LC 49 0261 (B) To assist local school systems in developing their own policies for student suicide prevention, the Department of Education, in consultation with the Suicide Prevention Program within the Department of Behavioral Health and Developmental Disabilities, shall establish a model policy for use by local school systems in accordance with this Code section. (b)(c) No person shall have a cause of action for any loss or damage caused by any act or omission resulting from the implementation of the provisions of this Code section or resulting from any training, or lack thereof, required by this Code section. (c)(d) The training, or lack thereof, required by the provisions of this Code section shall not be construed to impose any specific duty of care.\" SECTION 2. All laws and parts of laws in conflict with this Act are repealed. H. B. 9 - 4 -"}