{"legislative_id": 58788, "legislative_title": "Conservation and natural resources; certain conditions for permits for facilities that emit ethylene oxide; provide", "document_text": "LC 44 1542 House Bill 3 By: Representatives Allen of the 40th, Wilkerson of the 38th, Anulewicz of the 42nd, and Bruce of the 61st A BILL TO BE ENTITLED AN ACT To amend Code Section 12-9-7 of the Official Code of Georgia Annotated, relating to permit required, application, issuance, revocation, suspension, or amendment, so as to provide for certain conditions for permits for facilities that emit ethylene oxide; to provide for definitions; to provide for related matters; to repeal conflicting laws; and for other purposes. BE IT ENACTED BY THE GENERAL ASSEMBLY OF GEORGIA: SECTION 1. Code Section 12-9-7 of the Official Code of Georgia Annotated, relating to permit required, application, issuance, revocation, suspension, or amendment, is amended by revising subsection (a) as follows: \"(a)(1) As used in this subsection, the term 'spill or release' shall have the same meaning as set forth in paragraph (10) of Code Section 12-14-1.: (A) 'Exhaust point' means any point in a source designed to emit solids, liquids, or gases into the air, including a pipe or duct but not including flares. (B) 'Off gassing' means the release of a gas that was dissolved, trapped, frozen, or absorbed in a material. H. B. 3 - 1 -  LC 44 1542 (C) 'Spill or release' shall have the same meaning as set forth in paragraph (10) of Code Section 12-14-1. (2) No person shall, and it shall be unlawful and a violation of this article to, construct, install, modify, own, or operate any facility or stationary source or any equipment, device, article, or process capable of causing or contributing to the emission of air contaminants from such source or facility or designed to prevent air pollution from such facility or source unless permitted by and in compliance with a permit from the director. A permit shall be issued to an applicant on evidence satisfactory to the director of compliance with this article and any standards, limitations, requirements, or rules and regulations pursuant to this article. Notwithstanding any other provision of this article, the director shall not issue a Title V permit to a facility or source if the administrator objects in writing and in a timely manner to the issuance of such permit. (3) As a condition of a permit for operations that include the emission of ethylene oxide, any spill or release of ethylene oxide, regardless of the amount, shall be reported to the division in writing within 24 hours of discovering such spill or release. Any person who violates such reporting requirement shall be subject to penalties under Article 1 of this chapter. (4)(A) As an additional condition of any permit to release more than 50 pounds of ethylene oxide annually, each applicant or permittee shall: (i) Allow the division to install equipment that can detect and monitor ethylene oxide emissions from each exhaust point at the applicant's or permittee's location; and (ii) Allow the division to continuously monitor direct emissions of ethylene oxide and retain records of the daily release of ethylene oxide from each exhaust point for the term of the permit. (B) The director shall make publicly available on the divisions website at least twice annuallyinformationregardingthemonitoringrequiredbydivision(ii)ofsubparagraph (A) of this paragraph. H. B. 3 - 2 -  LC 44 1542 (C) Off gassing shall occur for no less than 36 hours in an area of an operation that utilizes a vent control system approved by the division. Off gassing shall not occur in any warehouse, building, or loading dock that does not utilize a vent control system approved by the division. (D) Each applicant or permittee whose facilities emit ethylene oxide shall submit to the division, by January 1, 2022, an ambient air monitoring plan. This plan shall include, at a minimum, the following: (i) Detailed plans to collect and analyze air samples of ethylene oxide on at least a quarterly basis nearest the property boundaries of the sterilization sources and at community locations with the highest modeled impact per the division's modeling; (ii) A quarterly sampling and analysis conducted over each consecutive six-day period; (iii) A detailed schedule for implementation of the plan; (iv) The name of the independent third-party company that will perform the sampling and analysis along with its qualifications and experience to perform such sampling and analysis; and (v) Results of each quarterly sampling and analysis, which shall also be submitted to the local county board of commissioners or the city council with jurisdiction thereof. Such plan shall be made available for public view and comment prior to an agreement with the division and shall be resubmitted every 24 months. (E) Any person who fails to comply with any requirement of this paragraph shall be subject to penalties under Article 1 of this chapter.\" SECTION 2. All laws and parts of laws in conflict with this Act are repealed. H. B. 3 - 3 -"}